import numpy as np
from numpy.polynomial.polynomial import Polynomial

# Предположим, x и y — это массивы NumPy одинаковой длины
# n — количество точек, k — степень полинома

# Пример данных (замените на свои)
x = [0.00275, 0.0055, 0.00825, 0.011, 0.01375, 0.0165, 0.022, 0.0275]
y = [0.0, 0.011929, 0.02662, 0.041191, 0.052775, 0.067418, 0.09703, 0.124383]
n = len(x)
k = 5.0608

x2 = [i ** 2 for i in x]
y2 = [j ** 2 for j in y]
a = sum(x2)/n
b = sum(y2)/n

c = ((a/b)-k**2)**0.5
ans = (1 / n**0.5) * c

print(ans)